title: NoPowerShell low hanging fruit basic info
status: Production
description: 
- basic information from default compiled nopowershell 
references:
- tas_kmanager's detecting the not-powershell gang defcon 28 btv presentation, https://github.com/tas-kmanager/SecurityPresentation/tree/master/DetectingTheNotPowershellGang
logsource:
  product: windows
author: tas_kmanager
date: 2020/08/04
falsepositives:
- none
level: high
tags:
    - attack.defenseevasion
    - attack.T1218.011
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
  description:
    Description:
    - '*NoPowerShell*'
  product:
    Product: 
    - '*NoPowerShell*'
  condition: selection or product or description